package ru.foxit.grayfox;

import java.util.Objects;
import java.util.Random;
import java.util.Scanner;

import static java.lang.Thread.sleep;

public class Main {
    
/**
* Ниже напишу то, что написал Максим Ресчиков
-----------------------------------------------Исправлено ниже-----------------------------------------------------
Scanner sc = new Scanner(System.in);
 
Random random = new Random();
Обьекты надо создавать вне цикла, в данной задаче нет такой необходимости.
На garbage collector надейся, а сам не плошай. в цикле будет куча объетов.
—--------------------------------------------Исправлено ниже-----------------------------------------------------
Scanner sc2 = new Scanner(System.in);
Нужно обойтись одним сканером на всю игру
—-------------------------------------------------Не исправлено-----------------------------------------------------
while (!sc2.hasNextInt()) { // Цикл для того, чтобы проверить, правильно ли ты вводишь цифры.
System.out.println("Вы ввели не число. Повторить игру еще раз? 1 – да / 0 – нет");
sc2.next(); //Ну а тут мы пропускаем введенное значение, если это цифры.
}
String yesno = sc2.next();
здесь 2 раза идет одно и толже вычисление sc2.next(); надо совместить, возможно придеться изменить алгоритм.
—----------------------------------------------------Не исправлено--------------------------------------------------
int start = 1; // Инициализируем int start и присваиваем 1.
while (start == 1) {
зачем? это я так понимаю внешний основной цикл. может проще воспользоваться do while, ведь нам все равно придется один раз пройти игру, если уж мы запустили программу.
—----------------Это я понял, но пусть пока будет в Main--------------------------------------------
Вообще желательно код было разбить на несколько методов, читаемость лучще. надо ознакомиться с процедурным программированием.
—----Комментарии я делаю для себя, чтобы понимать что я пишу--------------------
Правильное название переменных и методов, может польностью исключить комментарии. в них отпадает необходимость.
—----------------Спрошу на занятиях, как можно это по другому реализовать--------
if (Objects.equals(yesno, "1")) это конечно можно, но вы ведь работает со строками, так и желательно работать с методами строк, тем более что для строк в java метод equals переопределять не надо
посмотри:
https://docs.oracle.com/javase/8/docs/api/java/lang/String.html
сравни для строк:
public boolean equals(Object anObject) {
if (this == anObject) {
return true;
}
if (anObject instanceof String) {
String anotherString = (String)anObject;
int n = value.length;
if (n == anotherString.value.length) {
char v1[] = value;
char v2[] = anotherString.value;
int i = 0;
while (n— != 0) {
if (v1[i] != v2[i])
return false;
i++;
}
return true;
}
}
return false;
}
для обьектов:
public static boolean equals(Object a, Object b) {
return (a == b) || (a != null && a.equals(b));
}

public boolean equals(Object obj) {
return (this == obj);
}
*
**/
    
    // 1. Написать программу, которая загадывает случайное число от 0 до 9,
    // и пользователю дается 3 попытки угадать это число. При каждой попытке
    // компьютер должен сообщить больше ли указанное пользователем число чем
    // загаданное, или меньше. После победы или проигрыша выводится запрос –
    // «Повторить игру еще раз? 1 – да / 0 – нет»(1 – повторить, 0 – нет).

    // TODO 1. Написать программу, которая загадывает случайное число от 0 до 9, и пользователю дается 3 попытки угадать это число. При каждой попытке компьютер должен сообщить больше ли указанное пользователем число чем загаданное, или меньше. После победы или проигрыша выводится запрос – «Повторить игру еще раз? 1 – да / 0 – нет»(1 – повторить, 0 – нет).

    public static void main(String[] args) throws InterruptedException {
        Scanner sc = new Scanner(System.in);   // Инициализируем сканер для нашего ввода.
        Random random = new Random();          // Инициализируем сканер для генерации рандомных чисел.
        int receivedNum;                          // Инициализируем int receivedNum, для сканера ввода.
        String warnMin = "Почти угадал, число меньше загаданного"; // Если число меньше загаданного.
        String warnMax = "Почти угадал, число больше загаданного"; // Если чисто больше загаданного.
        int start = 1;                                  // Инициализируем int start и присваиваем 1.
        while (start == 1) {                       // Цикл while, который работает только если start = 1.
            int generateNum = random.nextInt(10); // Генерируем случайное число от 0 до 9, ставим на цифру больше - 10.
            System.out.print("Введите число от 0 до 9: ");             // Задаем вопрос игроку!
            int whiles = 0;        // Инициализируем int whiles и присваиваем 0 для цикла do - while.
            do {                   // Этот цикл проработает всего 3 раза, при неверных попытках.
                while (!sc.hasNextInt()) {
                    System.out.println("Вы ввели не число. Введите число от 0 до 9:");
                    sc.next();
                }
                receivedNum = sc.nextInt(); // Привязываем к receivedNum наше введенное число.

                //Включить, если ты хочешь всегда знать ответ.

                System.out.println("Число, которое загадала система: " + generateNum);
                System.out.println("Ваше число: " + receivedNum);

                if (receivedNum < generateNum) { //Если введенное число с клавы меньше сгенерированного
                    System.out.println(warnMax); // Выводим "Почти угадал, число больше загаданного"
                }
                if (receivedNum > generateNum) { //Если введенное число с клавы больше сгенерированного
                    System.out.println(warnMin); // Выводим "Почти угадал, число меньше загаданного"
                }
                if (receivedNum == generateNum) { //Если введенное число с клавы равно сгенерированному
                    System.out.println("Молодец! Ты угадал!");
                    break; // Выходим из цикла
                }
                whiles++; // Инкримент, прибавляется на 1 до 3 раз.
            } while (whiles < 3); // Затем после 3 раз выходит из цикла. (0, 1, 2)

            System.out.println("Ответ системы: " + generateNum); // Вопрос игроку
            System.out.println("Повторить игру еще раз? 1 – да / 0 – нет"); // Вопрос игроку
            while (!sc.hasNextInt()) { // Цикл для того, чтобы проверить, правильно ли ты вводишь цифры.
                System.out.println("Вы ввели не число. Повторить игру еще раз? 1 – да / 0 – нет");
                sc.next(); //Ну а тут мы пропускаем введенное значение, если это цифры.
            }
            String yesno = sc.next(); // Привязываем к yesno наше введенное число.
            //Нажимаем на if - Alt + Enter и replace if else with.
            if (Objects.equals(yesno, "1")) { //Если игрок вводит 1, мы переменной start даем единицу и цикл снова работает.
                start = 1;
            } else {
                start = 0; // В противном случае цикл не запуститься и мы пройдем дальше.
            }
        }

        sleep(1000); //Задержка примерно 1 секунда.
        System.out.println("Спасибо за игру! Вы отличный игрок!"); // Прощаемся с игроком.
        System.out.println("Завершаю игру через: "); //Завершаем работу!
        sleep(1000); //Задержка примерно 1 секунда.
        System.out.println("3");
        sleep(1000); //Задержка примерно 1 секунда.
        System.out.println("2");
        sleep(1000); //Задержка примерно 1 секунда.
        System.out.println("1");
        sleep(1000); //Задержка примерно 1 секунда.
    }
}
